/*
1. 整型：byte short int long 浮点型：float double 字符型：char 布尔型：boolean
   引用数据类型：Class Interface Array
2. public: + 
   private: -
   protect: #
   default: 默认
3. static：静态方法
4. 继承 extends: 儿子继承父亲，儿子拥有父亲的属性和方法
5. 多态：儿子继承父亲，儿子重写父亲方法
    java单集成，一子一父，一父多子
    向上转型：自动转换，父类引用指向子类对象
    向下转型：强制转换，父类引用指向子类对象，父类引用调用子类重写方法
6. 抽象类 abstract：不能实例化，只可以继承；抽象方法：没有方法体，必须被子类重写
7. 接口 interface：
    全抽象方法
    无状态
    多实现：可以实现多个接口
8. 构造方法：名称和类名相同，没有返回值
9. 类图
10. 关系：
    依赖：一个类使用另一个类
    泛化：继承
    实现：接口
    关联：一个类作为另一个类的属性
    聚合：部分可以脱离整体
    组合：部分不能脱离整体
11. 设计原则：
*/